
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>叁、信号参数定义       · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter3.html" />
    
    
    <link rel="prev" href="chapter2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    壹、快速架构导览
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    一、MC回测模版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    二、MC 与 评价大师 实盘模板
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    贰、动能评价投资法介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    一、动能评价函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    二、考虑风险评分散下的部位规模
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    三、策略商品持仓类别限制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.4" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    四、自动调整杠杆与可用资金缩放
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    叁、信号参数定义      
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="3.1.1" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    一、MC回测模版
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.1.2" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    二、MC 与 评价大师 实盘模板
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    肆、完整操作流程      
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.2.1" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    一、MC回测模版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2.2" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    二、MC 与 评价大师 实盘模板
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2.3" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    三、其他操作细节
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    伍、常见问题Q&A       
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >叁、信号参数定义      </a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x53C1;&#x3001;&#x4FE1;&#x53F7;&#x53C2;&#x6570;&#x5B9A;&#x4E49;">&#x53C1;&#x3001;&#x4FE1;&#x53F7;&#x53C2;&#x6570;&#x5B9A;&#x4E49;</h1>
<h2 id="&#x4E00;&#x3001;mc-&#x56DE;&#x6D4B;&#x6A21;&#x677F;">&#x4E00;&#x3001;MC &#x56DE;&#x6D4B;&#x6A21;&#x677F;</h2>
<blockquote>
<p><strong><font color="#1E90FF">@DVC5_PassEq_Chart:</font>  <font color="#32CD32">&#x5C06;&#x81EA;&#x5B9A;&#x4E49;&#x7B56;&#x7565;&#x7684;&#x7EE9;&#x6548;&#x8FDB;&#x884C;&#x591A;&#x7A7A;&#x62C6;&#x89E3;&#xFF0C;&#x591A;&#x7A7A;&#x4E2A;&#x522B;&#x8BC4;&#x4EF7;&#xFF0C;&#x4E8E;&#x5716;&#x8868;&#x4E0A;&#x4F7F;&#x7528;&#x3002;</font></strong></p>
</blockquote>
<ol>
<li><font color="#FF0000">Strategy: </font>
     <font color="#32CD32">&#x8BE5;&#x5546;&#x54C1;&#x4E4B;&#x7B56;&#x7565;&#x7F16;&#x53F7;&#xFF0C;&#x4ECE;&#x6570;&#x5B57;1&#x8D77;&#x4F9D;&#x5E8F;&#x5411;&#x4E0A;&#x7F16;&#x53F7;&#x3002;&#x4E0D;&#x540C;&#x5546;&#x54C1;&#x7686;&#x987B;&#x4ECE;1&#x5F00;&#x59CB;&#x7F16;&#x53F7;&#xFF0C;&#x4E0D;&#x53EF;&#x6DF7;&#x5408;&#x63A5;&#x7EED;&#x7F16;&#x53F7;&#x3002;</font>

</li>
</ol>
<p><br></p>
<blockquote>
<p><strong><font color="#1E90FF">@DVC5_PassEq: </font> &#x5C06;&#x81EA;&#x5B9A;&#x4E49;&#x7B56;&#x7565;&#x7684;&#x7EE9;&#x6548;&#x8FDB;&#x884C;&#x591A;&#x7A7A;&#x62C6;&#x89E3;&#xFF0C;&#x591A;&#x7A7A;&#x4E2A;&#x522B;&#x8BC4;&#x4EF7;&#xFF0C;<font color="##32CD32">&#x4E8E;PT&#x4E0A;&#x4F7F;&#x7528;&#x3002;</font></strong></p>
</blockquote>
<p><br></p>
<blockquote>
<p><strong><font color="#1E90FF">@DVC5_OriginalMM: </font> &#x8F38;&#x51FA;&#x539F;&#x59CB;&#x7B56;&#x7565;&#x7D44;&#x5408;&#x4E4B;&#x7E3E;&#x6548;&#x3002;</strong></p>
</blockquote>
<ol>
<li><p><font color="#FF0000">CapitalName: </font></p>
<pre><code>&#x539F;&#x59CB;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x4E4B;&#x6743;&#x76CA;&#x66F2;&#x7EBF;&#x540D;&#x79F0;&#xFF0C;&#x547D;&#x540D;&#x89C4;&#x5219;&#x4E3A;&quot;UD.MCQuote.xxx&quot;&#xFF0C;&#x5176;&#x4E2D;xxx&#x4E3A;&#x81EA;&#x5B9A;&#x4E49;&#x5B57;&#x4E32;&#x3002;
</code></pre><ol>
<li><font color="#FF0000"> RealCapital:</font> 
 &#x5B9E;&#x9645;&#x4EA4;&#x6613;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x91D1;&#x57FA;&#x5E95;&#x3002;</li>
</ol>
</li>
</ol>
<p><br></p>
<blockquote>
<p><strong><font color="#1E90FF">@DVC7_Set:  </font>&#x8BA1;&#x7B97;&#x8BC4;&#x5206;&#x51FD;&#x6570;&amp;&#x98CE;&#x9669;&#x5E73;&#x4EF7;&#x624B;&#x6570;&#x4FE1;&#x53F7;&#x3002;</strong></p>
</blockquote>
<ol>
<li><font color="#FF0000">Lookbackdays:</font> 
&#x52A8;&#x80FD;&#x89C2;&#x5BDF;&#x5929;&#x671F;&#xFF0C;&#x9009;&#x62E9;&#x533A;&#x95F4;&#x5927;&#x5C0F;&#x5F71;&#x54CD;&#x80A1;&#x4EF7;&#x53D8;&#x5316;&#x5BF9;&#x7ED9;&#x5206;&#x7684;&#x654F;&#x611F;&#x7A0B;&#x5EA6;&#xFF0C;&#x9009;&#x62E9;&#x8D8A;&#x5C0F;&#x7684;&#x89C2;&#x5BDF;&#x533A;&#x95F4;&#xFF0C;&#x80A1;&#x4EF7;&#x77ED;&#x65F6;&#x95F4;&#x7684; &#x53D8;&#x52A8;&#x5BF9;&#x52A8;&#x80FD;&#x7ED9;&#x5206;&#x5F71;&#x54CD;&#x8D8A;&#x5927;&#x3002;</li>
</ol>
<ol>
<li><p><font color="#FF0000">NegLeverage:</font>
&#x662F;&#x5426;&#x4F7F;&#x7528;&#x8D1F;&#x52A8;&#x80FD;&#x53CD;&#x5411;&#x6A21;&#x5F0F;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x5F00;&#x542F;&#xFF0C;0&#x4E3A;&#x5173;&#x95ED;&#x3002;</p>
</li>
<li><p><font color="#FF0000">WithSpread:</font>
&#x662F;&#x5426;&#x505A;&#x7B56;&#x7565;&#x6362;&#x6708;&#x4EF7;&#x5DEE;&#x8C03;&#x6574;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x5F00;&#x542F;&#xFF0C;0&#x4E3A;&#x5173;&#x95ED;&#x3002;&#x9274;&#x4E8E;&#x65B0;&#x65E7;&#x5408;&#x7EA6;&#x5728;&#x8F6C;&#x4ED3;&#x65F6;&#xFF0C;&#x5176;&#x56E0;&#x4E3A;&#x6362;&#x6708;&#x6240;&#x9020;&#x6210;&#x7684;&#x4EF7;&#x5DEE;&#x8DF3;&#x7A7A;&#x975E;&#x5C5E;&#x6B63;&#x5E38;&#x4EA4;&#x6613;&#x884C;&#x4E3A;&#xFF0C;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x56DE;&#x6D4B;&#x5931;&#x771F;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x900F;&#x8FC7;&#x6B64;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6B63;&#x6301;&#x4ED3;&#x635F;&#x76CA;&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyChannel:</font>
&#x7B56;&#x7565;&#x7C7B;&#x522B;&#x7F16;&#x53F7;&#xFF0C;&#x6BD4;&#x65B9;&#x6CE2;&#x6BB5;&#x7B56;&#x7565;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;1&#xFF0C;&#x5F53;&#x51B2;&#x7B56;&#x7565;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;2&#xFF0C;&#x9700;&#x4E3A;&#x5927;&#x4E8E;0&#x4E4B;&#x6574;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyChannelLimit:</font>
&#x8BE5;&#x7B56;&#x7565;&#x7C7B;&#x522B;&#x5F00;&#x653E;&#x6574;&#x5408;&#x4E4B;&#x7B56;&#x7565;&#x603B;&#x6570;&#x4E0A;&#x9650;&#xFF0C;&#x5982;&#x8BBE;&#x5B9A;5&#xFF0C;&#x4EE3;&#x8868;&#x8BE5;&#x7B56;&#x7565;&#x7C7B;&#x522B;&#x53D6;&#x8BC4;&#x5206;&#x524D;5&#x540D;&#x7684;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x6574;&#x5408;&#xFF0C;&#x6CE8;&#x610F;&#x76F8;&#x540C;&#x7F16;&#x53F7;&#x7684;&#x7B56;&#x7565;&#x7C7B;&#x522B;&#xFF0C;&#x6B64;&#x4E0A;&#x9650;&#x503C;&#x90FD;&#x987B;&#x8BBE;&#x5B9A;&#x4E00;&#x6837;&#x3002;</p>
</li>
<li><p><font color="#FF0000">pCapital:</font> 
&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x98CE;&#x9669;&#x5E73;&#x4EF7;&#x624B;&#x6570;&#x7684;&#x6D89;&#x9669;&#x91D1;&#x989D;&#xFF0C;&#x9ED8;&#x8BA4;&#x91C7;&#x53D6;&#x6B64;&#x503C;&#x7684;5%&#x8FDB;&#x884C;&#x6BCF;&#x7B14;&#x6295;&#x8D44;&#xFF0C;&#x6D89;&#x9669;&#x91D1;&#x989D;&#x8BBE;&#x5B9A;&#x8D8A;&#x9AD8;&#xFF0C;&#x6BCF;&#x4E2A;&#x5546;&#x54C1;&#x7684;&#x98CE;&#x9669;&#x8BC4;&#x4EF7;&#x624B;&#x6570;&#x8D8A;&#x5927;&#x3002;</p>
</li>
<li><p><font color="#FF0000">RPLen:</font>
&#x6CE2;&#x52A8;&#x7387;&#x89C2;&#x5BDF;&#x5929;&#x671F;&#xFF0C;&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x98CE;&#x9669;&#x8BC4;&#x4EF7;&#x624B;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">VolType:</font>
&#x6CE2;&#x52A8;&#x7387;&#x91C7;&#x7528;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;2&#x4E3A;ATR&#xFF0C;&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x98CE;&#x9669;&#x8BC4;&#x4EF7;&#x624B;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">PositionWeight:</font>
&#x8BE5;&#x7B56;&#x7565;&#x4E4B;&#x4E0B;&#x5355;&#x6743;&#x91CD;&#xFF0C;&#x4F9B;&#x4F7F;&#x7528;&#x8005;&#x8C03;&#x6574;&#x7B56;&#x7565;&#x95F4;&#x4E4B;&#x4E0B;&#x5355;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><br></p>
<blockquote>
<p><font color="#1E90FF">**@DVC7_Order: </font> &#x7B56;&#x7565;&#x8BC4;&#x5206;&#x6574;&#x5408;&amp;&#x4E0B;&#x5355;&#x4FE1;&#x53F7;&#x3002;**</p>
</blockquote>
</li>
</ol>
<ol>
<li><p><font color="#FF0000">pCapital:  </font>
&#x8BE5;&#x5546;&#x54C1;&#x4E0B;&#x5355;&#x4E4B;&#x53C2;&#x8003;&#x8D44;&#x91D1;&#xFF0C;&#x4E0E;&#x8D44;&#x91D1;&#x57FA;&#x5E95;&#x642D;&#x914D;&#x8FDB;&#x884C;&#x6BD4;&#x4F8B;&#x5F0F;&#x4E0B;&#x5355;&#xFF0C;&#x5EFA;&#x8BAE;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5982;10000000&#x3002;</p>
</li>
<li><p><font color="#FF0000">CommodityChannel: </font>
&#x5546;&#x54C1;&#x7C7B;&#x522B;&#x7F16;&#x53F7;&#xFF0C;&#x6BD4;&#x65B9;&#x6307;&#x6570;&#x671F;&#x8D27;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;1&#xFF0C;&#x519C;&#x4EA7;&#x54C1;&#x671F;&#x8D27;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;2&#xFF0C;&#x9700;&#x4E3A;&#x5927;&#x4E8E;0&#x4E4B;&#x6574;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">CommodityChannelLimit: </font>
&#x8BE5;&#x5546;&#x54C1;&#x7C7B;&#x522B;&#x5F00;&#x653E;&#x4EA4;&#x6613;&#x4E4B;&#x5546;&#x54C1;&#x603B;&#x6570;&#x4E0A;&#x9650;&#xFF0C;&#x5982;&#x8BBE;&#x5B9A;3&#xFF0C;&#x4EE3;&#x8868;&#x8BE5;&#x5546;&#x54C1;&#x7C7B;&#x522B;&#x53D6;&#x603B;&#x8BC4;&#x5206;&#x524D;3&#x540D;&#x7684;&#x5546;&#x54C1;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyTotalN: </font>
&#x8BE5;&#x5546;&#x54C1;&#x5F00;&#x653E;&#x6574;&#x5408;&#x4E4B;&#x7B56;&#x7565;&#x603B;&#x6570;&#x4E0A;&#x9650;&#xFF0C;&#x5982;&#x8BBE;&#x5B9A;12&#xFF0C;&#x4EE3;&#x8868;&#x8BE5;&#x5546;&#x54C1;&#x7684;&#x7B56;&#x7565;&#x6C60;&#x4E2D;&#xFF0C;&#x81F3;&#x591A;&#x53D6;12&#x540D;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x6574;&#x5408;&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyScoreThres: </font>
&#x7B56;&#x7565;&#x8BC4;&#x5206;&#x95E8;&#x69DB;&#xFF0C;&#x8BC4;&#x5206;&#x9AD8;&#x4E8E;&#x6B64;&#x503C;&#x624D;&#x6709;&#x8D44;&#x683C;&#x8FDB;&#x5165;&#x6574;&#x5408;&#x540D;&#x5355;&#x3002;&#x95E8;&#x69DB;&#x8D8A;&#x9AD8;&#xFF0C;&#x7B56;&#x7565;&#x54C1;&#x8D28;&#x4E5F;&#x76F8;&#x5BF9;&#x9AD8;&#xFF0C;&#x4F46;&#x4EA4;&#x6613;&#x6B21;&#x6570;&#x8F83;&#x5C11;&#x3002;</p>
</li>
<li><p><font color="#FF0000">WithSpread: </font>
&#x662F;&#x5426;&#x505A;&#x5546;&#x54C1;&#x6362;&#x6708;&#x4EF7;&#x5DEE;&#x8C03;&#x6574;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x5F00;&#x542F;&#xFF0C;0&#x4E3A;&#x5173;&#x95ED;&#x3002;&#x9274;&#x4E8E;&#x65B0;&#x65E7;&#x5408;&#x7EA6;&#x5728;&#x8F6C;&#x4ED3;&#x65F6;&#xFF0C;&#x5176;&#x56E0;&#x4E3A;&#x6362;&#x6708;&#x6240;&#x9020;&#x6210;&#x7684;&#x4EF7;&#x5DEE;&#x8DF3;&#x7A7A;&#x975E;&#x5C5E;&#x6B63;&#x5E38;&#x4EA4;&#x6613;&#x884C;&#x4E3A;&#xFF0C;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x56DE;&#x6D4B;&#x5931;&#x771F;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x900F;&#x8FC7;&#x6B64;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6B63;&#x6301;&#x4ED3;&#x635F;&#x76CA;&#x3002;</p>
</li>
</ol>
<p><br></p>
<blockquote>
<p><font color="#1E90FF">**@DVC7_XeusMM: </font> &#x5546;&#x54C1;&#x7BA1;&#x7406;&#x4FE1;&#x53F7;&#x3002;**</p>
</blockquote>
<ol>
<li><font color="#FF0000">CommodityTotalN:</font> 
&#x5F00;&#x653E;&#x4EA4;&#x6613;&#x4E4B;&#x5546;&#x54C1;&#x603B;&#x6570;&#x4E0A;&#x9650;&#xFF0C;&#x5982;&#x8BBE;&#x5B9A;15&#xFF0C;&#x4EE3;&#x8868;&#x6574;&#x4E2A;&#x6295;&#x8D44;&#x7EC4;&#x5408;&#x81F3;&#x591A;&#x4EA4;&#x6613;15&#x4E2A;&#x5546;&#x54C1;&#x3002;</li>
</ol>
<ol>
<li><p><font color="#FF0000">ChangeThres:</font> 
&#x5546;&#x54C1;&#x603B;&#x8BC4;&#x5206;&#x6709;&#x6548;&#x53D8;&#x91CF;&#xFF0C;&#x5F53;&#x5546;&#x54C1;&#x5DF2;&#x6301;&#x4ED3;&#xFF0C;&#x4E14;&#x603B;&#x8BC4;&#x5206;&#x53D8;&#x52A8;&#x8D85;&#x8FC7;&#x6B64;&#x503C;&#xFF0C;&#x624D;&#x8FDB;&#x884C;&#x52A0;&#x51CF;&#x7801;&#x624B;&#x6570;&#x8C03;&#x6574;&#x3002;&#x6709;&#x6548;&#x53D8;&#x91CF;&#x8BBE;&#x5B9A;&#x8D8A;&#x9AD8;&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x7B56;&#x7565;&#x53D7;&#x5230;&#x6742;&#x8BAF;&#x800C;&#x9891;&#x7E41;&#x8FDB;&#x51FA;&#x3002;</p>
</li>
<li><p><font color="#FF0000">CommodityScoreThres:</font> 
&#x5546;&#x54C1;&#x603B;&#x8BC4;&#x5206;&#x95E8;&#x69DB;&#xFF0C;&#x5F53;&#x603B;&#x8BC4;&#x5206;&#x8D85;&#x8FC7;&#x6B64;&#x95E8;&#x69DB;&#xFF0C;&#x624D;&#x5F00;&#x653E;&#x8BE5;&#x5546;&#x54C1;&#x4EA4;&#x6613;&#x8FDB;&#x573A;&#xFF0C;&#x4E14;&#x5728;&#x6B64;&#x95E8;&#x69DB;&#x4E4B;&#x4E0A;&#xFF0C;&#x8BC4;&#x5206;&#x6709;&#x6548;&#x53D8;&#x91CF;&#x673A;&#x5236;&#x624D;&#x4F1A;&#x542F;&#x7528;&#x3002;</p>
</li>
<li><p><font color="#FF0000">CapitalName:</font><br>&#x8BC4;&#x4EF7;&#x540E;&#x4E4B;&#x6743;&#x76CA;&#x66F2;&#x7EBF;&#x540D;&#x79F0;&#xFF0C;&#x547D;&#x540D;&#x89C4;&#x5219;&#x4E3A;&quot;UD.MCQuote.xxx&quot;&#xFF0C;&#x5176;&#x4E2D;xxx&#x4E3A;&#x81EA;&#x5B9A;&#x4E49;&#x5B57;&#x4E32;&#x3002;</p>
</li>
<li><p><font color="#FF0000">RealCapital:</font><br>&#x5B9E;&#x9645;&#x4EA4;&#x6613;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x91D1;&#x57FA;&#x5E95;&#xFF0C;&#x4E0E;&#x53C2;&#x8003;&#x8D44;&#x91D1;&#x642D;&#x914D;&#x8FDB;&#x884C;&#x6BD4;&#x4F8B;&#x5F0F;&#x4E0B;&#x5355;&#xFF0C;&#x5EFA;&#x8BAE;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x53C2;&#x8003;&#x8D44;&#x91D1;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5982;2000000&#x3002;</p>
</li>
<li><p><font color="#FF0000">PosSize:</font><br>&#x8D44;&#x91D1;&#x6760;&#x6746;&#x53C2;&#x6570;&#xFF0C;&#x6B64;&#x503C;&#x8BBE;&#x5B9A;&#x8D8A;&#x5927;&#xFF0C;&#x6D89;&#x9669;&#x91D1;&#x989D;&#x4E0E;&#x90E8;&#x4F4D;&#x89C4;&#x6A21;&#x4E5F;&#x8D8A;&#x5927;&#x3002;</p>
</li>
<li><p><font color="#FF0000">IncWeight:</font><br>&#x5373;&#x65F6;&#x635F;&#x76CA;&#x518D;&#x6295;&#x5165;&#x6BD4;&#x4F8B;&#xFF0C;&#x5C06;&#x5373;&#x65F6;&#x635F;&#x76CA;&#x7EB3;&#x5165;&#x52A0;&#x51CF;&#x7801;&#x90E8;&#x4F4D;&#x4E4B;&#x6BD4;&#x4F8B;&#xFF0C;&#x8F93;&#x5165;0&#x4EE3;&#x8868;&#x4E0D;&#x4F7F;&#x7528;&#x6B64;&#x6761;&#x4EF6;&#x3002;</p>
</li>
<li><p><font color="#FF0000">IncLimit:</font><br>&#x635F;&#x76CA;&#x6743;&#x91CD;&#x5206;&#x914D;&#x4E4B;&#x4E0A;&#x9650;&#x3002;</p>
</li>
<li><p><font color="#FF0000">MaxLossPercent:</font><br>&#x7B56;&#x7565;&#x6700;&#x5927;&#x4E8F;&#x635F;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x82E5;&#x5F53;&#x524D;&#x6D6E;&#x52A8;&#x635F;&#x76CA;&#x8FBE;&#x5230;&#x6B64;&#x503C;&#x5219;&#x5F3A;&#x5236;&#x5E73;&#x4ED3;&#x3002;&#x4EE5;&#x767E;&#x5206;&#x6BD4;&#x8868;&#x793A;&#xFF0C;&#x8F93;&#x5165;5&#x4EE3;&#x8868;5%&#xFF0C;&#x8F93;&#x5165;0&#x4EE3;&#x8868;&#x4E0D;&#x4F7F;&#x7528;&#x6B64;&#x6761;&#x4EF6;&#x3002;</p>
</li>
<li><p><font color="#FF0000">RiskTakeType:</font><br>&#x52A8;&#x7528;&#x98CE;&#x9669;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#xFF0C;&#x7528;&#x4EE5;&#x63A7;&#x7BA1;&#x65B0;&#x7B56;&#x7565;&#x662F;&#x5426;&#x8FDB;&#x573A;</p>
<pre><code>&#x8F93;&#x5165;0: &#x5173;&#x95ED;&#xFF0C;&#x5BF9;&#x4E8E;&#x65B0;&#x8FDB;&#x573A;&#x9879;&#x76EE;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x9650;&#x5236;&#x3002;
&#x8F93;&#x5165;1: &#x5982;&#x679C;&#x65E7;&#x6709;&#x90E8;&#x4F4D;&#x52A0;&#x4ED3;&#x6216;&#x65B0;&#x7B56;&#x7565;&#x52A0;&#x5165;&#x540E;&#x4F1A;&#x8D85;&#x8FC7;&#x98CE;&#x9669;&#x4E0A;&#x9650;&#xFF0C;&#x5219;&#x9650;&#x5236;&#x52A0;&#x4ED3;&#x6216;&#x65B0;&#x7B56;&#x7565;&#x52A0;&#x5165;&#x3002;
</code></pre></li>
<li><p><font color="#FF0000">RiskTakenLimit: </font> 
&#x52A8;&#x7528;&#x98CE;&#x9669;&#x4E0A;&#x9650;&#x3002;</p>
</li>
<li><p><font color="#FF0000">NonProtect:</font> 
&#x672A;&#x53D7;&#x4FDD;&#x62A4;&#x5546;&#x54C1;&#x6570;&#xFF0C;&#x4E3A;&#x4E0D;&#x53D7;&#x52A0;&#x4ED3;&#x4FDD;&#x62A4;&#x57AB;&#x7EA7;&#x8DDD;&#x9650;&#x5236;&#x7684;&#x6700;&#x5927;&#x4FE1;&#x53F7;&#x6570;&#x91CF;&#x3002;</p>
</li>
<li><p><font color="#FF0000">ProtectPad:</font> 
&#x52A0;&#x4ED3;&#x4FDD;&#x62A4;&#x57AB;&#x7EA7;&#x8DDD;&#xFF0C;&#x5F53;&#x6301;&#x4ED3;&#x5546;&#x54C1;&#x6570;&#x8D85;&#x8FC7;NonProtect&#x4F46;&#x662F;&#x5C1A;&#x672A;&#x8FBE;&#x5230;CommodityTotalN&#xFF0C;&#x5219;&#x540E;&#x7EED;&#x6BCF;&#x65B0;&#x589E;&#x4E00;&#x4E2A;&#x5546;&#x54C1;&#xFF0C;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x4E2A;ProtectPad&#x3002;</p>
<pre><code>&#x4F8B;&#x5982;NonProtect=4 (&#x4E2A;)&#x3001;CommodityTotalN=6 (&#x4E2A;)&#x3001;ProtectPad=50000&#xFF0C;
&#x5219;&#x5F53;&#x7B2C;5&#x4E2A;&#x5546;&#x54C1;&#x8981;&#x8FDB;&#x6765;&#xFF0C;&#x9700;&#x8981;&#x524D; 4&#x4E2A;&#x5546;&#x54C1;&#x6D6E;&#x52A8;&#x635F;&#x76CA;&#x5230;&#x8FBE;ProtectPad =50000&#xFF0C;
&#x5F53;&#x7B2C;6&#x4E2A;&#x5546;&#x54C1;&#x8981;&#x8FDB;&#x6765;&#x9700;&#x8981;&#x524D; 5&#x4E2A;&#x5546;&#x54C1;&#x6D6E;&#x52A8;&#x635F;&#x76CA;&#x5230;&#x8FBE;2*ProtectPad=2*50000=100000
</code></pre></li>
</ol>
<p><br></p>
<blockquote>
<p><strong><font color="#1E90FF">AutoLeverage:</font>  &#x81EA;&#x52A8;&#x8C03;&#x6574;&#x6760;&#x6746;&#x4E0E;&#x53EF;&#x7528;&#x8D44;&#x91D1;&#x7F29;&#x653E;&#x3002;</strong></p>
</blockquote>
<ol>
<li><p><font color="#FF0000">Len:</font> 
&#x6A21;&#x62DF;&#x8D44;&#x91D1;&#x66F2;&#x7EBF;&#x4E4B;&#x89C2;&#x5BDF;&#x5929;&#x671F;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x6743;&#x76CA;&#x66F2;&#x7EBF;&#x4E4B;&#x6CE2;&#x52A8;&#x7387;&#x3001;&#x5E03;&#x6797;&#x901A;&#x9053;&#x7B49;&#x3002;</p>
</li>
<li><p><font color="#FF0000">mainleverage:</font> 
&#x8D44;&#x91D1;&#x6760;&#x6746;&#x6C34;&#x4F4D;&#xFF0C;&#x53EF;&#x6839;&#x636E;&#x81EA;&#x5B9A;&#x4E49;&#x6F14;&#x7B97;&#x6CD5;&#x8C03;&#x6574;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x6760;&#x6746;&#x7F29;&#x653E;&#x3002;</p>
</li>
<li><p><font color="#FF0000">ReinvestmentDelta:</font> 
&#x53EF;&#x7528;&#x8D44;&#x91D1;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#xFF0C;&#x4EE5;&#x767E;&#x5206;&#x6BD4;&#x8868;&#x793A;&#xFF0C;&#x8F93;&#x5165;5&#x4EE3;&#x8868;5%&#xFF0C;&#x5219;&#x5F53;&#x53EF;&#x7528;&#x8D44;&#x91D1;&#x6210;&#x957F;&#x81F3;105%(95%)&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x53EF;&#x7528;&#x8D44;&#x91D1;&#x66F4;&#x65B0;&#x81F3;&#x5F53;&#x524D;&#x6570;&#x503C;&#xFF0C;&#x8FDB;&#x884C;&#x8D44;&#x91D1;&#x7F29;&#x653E;&#xFF0C;&#x8F93;&#x5165;0&#x4EE3;&#x8868;&#x4E0D;&#x4F7F;&#x7528;&#x6B64;&#x6761;&#x4EF6;&#x3002;</p>
<p><br></p>
</li>
</ol>
<h2 id="&#x4E8C;&#x3001;mc-&#x4E0E;-&#x8BC4;&#x4EF7;&#x5927;&#x5E08;-&#x5B9E;&#x76D8;&#x6A21;&#x677F;">&#x4E8C;&#x3001;MC &#x4E0E; &#x8BC4;&#x4EF7;&#x5927;&#x5E08; &#x5B9E;&#x76D8;&#x6A21;&#x677F;</h2>
<blockquote>
<p><strong><font color="#1E90FF">@DVC7_ToDaVinci: </font>&#x8BC4;&#x5206;&#x51FD;&#x6570;&#x53CA;&#x98CE;&#x9669;&#x5E73;&#x4EF7;&#x53E3;&#x6570;&#x4FE1;&#x53F7;&#xFF0C;<font color="##32CD32">&#x6302;&#x8F7D;&#x4E8E;&#x56FE;&#x8868;&#x6216;PT&#x7686;&#x53EF;&#x4F7F;&#x7528;&#x3002;</font></strong></p>
</blockquote>
<ol>
<li><font color="#FF0000">Lookbackdays: :</font> 
&#x52A8;&#x80FD;&#x89C2;&#x5BDF;&#x5929;&#x671F;&#xFF0C;&#x9009;&#x62E9;&#x533A;&#x95F4;&#x5927;&#x5C0F;&#x5F71;&#x54CD;&#x80A1;&#x4EF7;&#x53D8;&#x5316;&#x5BF9;&#x7ED9;&#x5206;&#x7684;&#x654F;&#x611F;&#x7A0B;&#x5EA6;&#xFF0C;&#x9009;&#x62E9;&#x8D8A;&#x5C0F;&#x7684;&#x89C2;&#x5BDF;&#x533A;&#x95F4;&#xFF0C;&#x80A1;&#x4EF7;&#x77ED;&#x65F6;&#x95F4;&#x7684;&#x53D8;&#x52A8;&#x5BF9;&#x52A8;&#x80FD;&#x7ED9;&#x5206;&#x5F71;&#x54CD;&#x8D8A;&#x5927;&#x3002;</li>
</ol>
<ol>
<li><p><font color="#FF0000">NegLeverage::</font>
&#x662F;&#x5426;&#x4F7F;&#x7528;&#x8D1F;&#x52A8;&#x80FD;&#x53CD;&#x5411;&#x6A21;&#x5F0F;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x5F00;&#x542F;&#xFF0C;0&#x4E3A;&#x5173;&#x95ED;&#x3002;</p>
</li>
<li><p><font color="#FF0000">WithSpread::</font>
&#x662F;&#x5426;&#x505A;&#x7B56;&#x7565;&#x6362;&#x6708;&#x4EF7;&#x5DEE;&#x8C03;&#x6574;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x5F00;&#x542F;&#xFF0C;0&#x4E3A;&#x5173;&#x95ED;&#x3002;&#x9274;&#x4E8E;&#x65B0;&#x65E7;&#x5408;&#x7EA6;&#x5728;&#x8F6C;&#x4ED3;&#x65F6;&#xFF0C;&#x5176;&#x56E0;&#x4E3A;&#x6362;&#x6708;&#x6240;&#x9020;&#x6210;&#x7684;&#x4EF7;&#x5DEE;&#x8DF3;&#x7A7A;&#x975E;&#x5C5E;&#x6B63;&#x5E38;&#x4EA4;&#x6613;&#x884C;&#x4E3A;&#xFF0C;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x635F;&#x76CA;&#x8BA1;&#x7B97;&#x5931;&#x771F;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x900F;&#x8FC7;&#x6B64;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6B63;&#x6301;&#x4ED3;&#x635F;&#x76CA;&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyChannel::</font>
&#x7B56;&#x7565;&#x7C7B;&#x522B;&#x7F16;&#x53F7;&#xFF0C;&#x6BD4;&#x65B9;&#x6CE2;&#x6BB5;&#x7B56;&#x7565;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;1&#xFF0C;&#x5F53;&#x51B2;&#x7B56;&#x7565;&#x90FD;&#x8BBE;&#x5B9A;&#x4E3A;2&#x3002;</p>
</li>
<li><p><font color="#FF0000">StrategyName::</font>
&#x7531;MC&#x8F93;&#x51FA;&#x81F3;&#x8BC4;&#x4EF7;&#x5927;&#x5E08;&#x6240;&#x663E;&#x793A;&#x4E4B;&#x7B56;&#x7565;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x4E24;&#x4E2A;&#x53CC;&#x5F15;&#x53F7;&#x6240;&#x6DB5;&#x76D6;&#x7684;&#x6587;&#x5B57;&#x683C;&#x5F0F;&#xFF0C;&#x5982;&quot;MACD-L&quot;&#x3002;&#x6BCF;&#x4E2A;Strategy&#x8BF7;&#x8F93;&#x5165;&#x4E0D;&#x540C;&#x540D;&#x79F0;&#xFF0C;&#x5982;&#x6709;&#x540C;&#x7B56;&#x7565;&#x4F46;&#x5468;&#x671F;&#x6216;&#x53C2;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x8BF7;&#x52A0;&#x4E0A;&#x5176;&#x4ED6;&#x6587;&#x5B57;&#x6216;&#x7F16;&#x53F7;&#x4EE5;&#x4F9B;&#x533A;&#x9694;&#xFF0C;&#x5982;&quot;MACD-L1&quot;&#x3001;&quot;MACD-L2&quot;&#x3002;</p>
</li>
<li><p><font color="#FF0000">pCapital::</font>
&#x8BE5;&#x5546;&#x54C1;&#x4E0B;&#x5355;&#x4E4B;&#x53C2;&#x8003;&#x8D44;&#x91D1;&#xFF0C;&#x4E0E;&#x8D44;&#x91D1;&#x57FA;&#x5E95;&#x642D;&#x914D;&#x8FDB;&#x884C;&#x6BD4;&#x4F8B;&#x5F0F;&#x4E0B;&#x5355;&#xFF0C;&#x5EFA;&#x8BAE;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5927;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5982;10000000&#xFF0C;&#x6CE8;&#x610F;&#x6B64;&#x503C;&#x987B;&#x4E0E;&#x8BC4;&#x4EF7;&#x5927;&#x5E08;&#x4E2D;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x91D1;&#x8BBE;&#x5B9A;&#x76F8;&#x540C;&#x3002;</p>
</li>
<li><p><font color="#FF0000">RPLen::</font> 
&#x6CE2;&#x52A8;&#x7387;&#x89C2;&#x5BDF;&#x5929;&#x671F;&#xFF0C;&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x98CE;&#x9669;&#x8BC4;&#x4EF7;&#x624B;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">VolType::</font>
&#x6CE2;&#x52A8;&#x7387;&#x91C7;&#x7528;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#xFF0C;&#x8BBE;&#x5B9A;1&#x4E3A;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;2&#x4E3A;ATR&#xFF0C;&#x7528;&#x4EE5;&#x8BA1;&#x7B97;&#x98CE;&#x9669;&#x8BC4;&#x4EF7;&#x624B;&#x6570;&#x3002;</p>
</li>
<li><p><font color="#FF0000">PositionWeight::</font>
&#x8BE5;&#x7B56;&#x7565;&#x4E4B;&#x4E0B;&#x5355;&#x6743;&#x91CD;&#xFF0C;&#x4F9B;&#x4F7F;&#x7528;&#x8005;&#x8C03;&#x6574;&#x7B56;&#x7565;&#x95F4;&#x4E4B;&#x4E0B;&#x5355;&#x6BD4;&#x4F8B;&#x3002;</p>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter2.html" class="navigation navigation-prev " aria-label="Previous page: 四、自动调整杠杆与可用资金缩放">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter3.html" class="navigation navigation-next " aria-label="Next page: 一、MC回测模版">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"叁、信号参数定义      ","level":"3.1","depth":1,"next":{"title":"一、MC回测模版","level":"3.1.1","depth":2,"path":"chapter3.md","ref":"chapter3.md","articles":[]},"previous":{"title":"四、自动调整杠杆与可用资金缩放","level":"2.1.4","depth":2,"path":"chapter2.md","ref":"chapter2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3.md","mtime":"2019-09-10T06:24:15.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-26T02:29:23.589Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

